//Задача 3: Напишите программу, которая на вход
//принимает число и выдаёт, является ли число
//чётным (делится ли оно на два без остатка).
//4 -> да
//-3 -> нет
//7 -> нет
Console.WriteLine("введите число");
int n = int.Parse(Console.ReadLine()!);
int d = 2;
if (n % d == 0)

Console.WriteLine("число четное");
    
else

    Console.WriteLine("число не четное");
    





    
